{
  "backend/main.mo": "Motoko canister defining per-user state for profiles, onboarding answers, reflection timing, and sentence history, with access-controlled query and update methods for onboarding and daily reflections.",
  "feature_evidence.json": "Machine-readable report mapping implemented product features to frontend files, components, test IDs, and confidence levels for requirements tracking.",
  "frontend-file-summaries.txt": "Prewritten summary map describing the purpose of each frontend source file for documentation and planning reference.",
  "frontend/index.css": "Global Tailwind CSS setup defining a minimal clinical design system with OKLCH color tokens, light typography, and dark mode variables.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that coordinates authentication, profile setup, onboarding, and the main experience based on user state.",
  "frontend/src/components/AuthGate.tsx": "Sign-in screen that prompts unauthenticated users to log in with Internet Identity using a minimal centered layout.",
  "frontend/src/components/Header.tsx": "Top navigation header showing the app title, reset control, and sign-out action that clears identity and cached queries.",
  "frontend/src/components/ProfileSetup.tsx": "First-time profile setup form that collects and saves the user’s name before continuing into the app.",
  "frontend/src/features/daily/DailySurface.tsx": "Daily experience container that renders nothing on silent days or shows the explanation block when a reflection is due.",
  "frontend/src/features/daily/ExplanationBlock.tsx": "Centered view that displays a single synthesized explanation sentence from onboarding answers and logs an uncushioned reflection when toggled.",
  "frontend/src/features/MainExperience.tsx": "Main router that decides between onboarding, weekly reflection, or daily surface based on backend reflection state.",
  "frontend/src/features/onboarding/OnboardingFlow.tsx": "Implements a four-step onboarding form that collects free-text answers and submits them to the backend on completion. Manages step state, input validation, and mutation loading states.",
  "frontend/src/features/onboarding/onboardingQuestions.ts": "Defines the static list of onboarding questions and the OnboardingStep union type used to index them.",
  "frontend/src/features/settings/ResetControl.tsx": "Provides a small UI control to reset onboarding data with a confirmation step, backed by a reset mutation.",
  "frontend/src/features/weekly/WeeklyReflection.tsx": "Generates and displays a weekly reflection sentence based on sentence history, and logs the weekly reflection once on mount.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using React Query, handling authenticated vs anonymous identities and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via a React context, managing login, logout, identity persistence, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions, including user profiles, onboarding state, reflections, and sentence history mutations and queries.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, color tokens, light/dark themes, and global typography rules.",
  "frontend/src/lib/textConstraints.ts": "Defines prohibited words and helper functions to validate text and detect disallowed language or question marks.",
  "frontend/src/lib/textSynthesis.ts": "Generates explanatory and reflective sentences from onboarding answers and history, applying text validation constraints.",
  "frontend/src/main.tsx": "Bootstraps the React app by rendering App with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them. Includes logic to prioritize URL values, safely handle storage errors, and remove sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, and extensive theme extensions for colors, typography, animations, radii, shadows, and fonts. Registers official plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s schema version, high-level product summary, and a structured list of implemented features with IDs, titles, requirement links, and versions. Captures the intended behavior of a minimal self-clarity app and its core onboarding and reflection mechanics."
}