{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make It Make Sense — minimal coherence engine (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add Internet Identity sign-in gating and ensure all displayed data is scoped to the authenticated principal.",
      "acceptanceCriteria": [
        "User can sign in/out with Internet Identity.",
        "Data shown in the app is scoped to the currently authenticated principal.",
        "A new principal sees onboarding; a returning principal does not (unless explicitly reset via a non-question control—see other requirements)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the top-level app shell that uses the authorization component’s frontend auth pattern (useInternetIdentity + useActor) to gate all application data behind sign-in, and to clear cached per-user queries on logout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "create",
          "description": "Create an auth gate that renders only sign-in/sign-out controls when unauthenticated and renders the app experience only after an Internet Identity is present. Use the authorization component’s guidance for logout cache clearing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "create",
          "description": "Add a React Query hook to load/save the caller user profile via backend calls, following the authorization component guidance to avoid a first-login setup flash. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetup.tsx",
          "operation": "create",
          "description": "Create a first-login profile setup screen that captures a name without phrasing it as a question (no question mark), and persists it using backend profile methods (required by the authorization component). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Ensure App is properly wired as the root after InternetIdentityProvider and QueryClientProvider, and ensure auth state changes cause the UI to re-render into the correct gated flow."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement run-once onboarding: exactly four questions, one-at-a-time, stored verbatim, then transition to the normal experience.",
      "acceptanceCriteria": [
        "Questions are displayed one at a time (no multi-question form).",
        "The question text matches exactly (including punctuation/case) as provided.",
        "User responses are stored exactly as entered and can be retrieved losslessly (including capitalization and punctuation).",
        "After the 4th answer is submitted, onboarding is marked complete and the app transitions to the normal (mostly-silent) experience.",
        "After onboarding completes, the app does not ask any additional questions anywhere."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/onboarding/onboardingQuestions.ts",
          "operation": "create",
          "description": "Define the onboarding question copy as a fixed ordered list with the exact wording provided, used as the single source of truth for the onboarding UI."
        },
        {
          "path": "frontend/src/hooks/useOnboarding.ts",
          "operation": "create",
          "description": "Add hooks to fetch onboarding status/answers and to initialize/update onboarding answers via backend calls, ensuring answers are sent and stored verbatim (no frontend summarization or interpretation)."
        },
        {
          "path": "frontend/src/features/onboarding/OnboardingFlow.tsx",
          "operation": "create",
          "description": "Implement a one-question-at-a-time onboarding flow that displays exactly the specified question text and captures a verbatim response per step; after step 4, call the backend to finalize onboarding and transition into the normal experience."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the onboarding flow into the authenticated app: if onboarding is incomplete for the signed-in principal, render OnboardingFlow; otherwise render the daily/weekly experience."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement the mostly-silent daily experience: usually render nothing; sometimes render exactly one sentence derived only from stored onboarding wording (edited only for clarity).",
      "acceptanceCriteria": [
        "On days when the app is in “silent” mode, the main content area renders no sentence and no substitute motivational copy (silence is preserved).",
        "On days when the app surfaces content, it renders exactly one sentence (single line/paragraph) and nothing else in the content area.",
        "The surfaced sentence is constructed entirely from the user’s saved onboarding answers; any edits are limited to grammar/clarity (e.g., minor punctuation, removing duplicates, resolving pronouns where possible without adding new ideas).",
        "The app never appends advice, encouragement, reassurance, diagnosis, or action suggestions to the daily sentence.",
        "The app does not ask any questions in this daily experience mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useReflectionState.ts",
          "operation": "create",
          "description": "Add a hook that fetches per-user reflection state (daily/weekly due flags) and exposes stable loading/error states for the experience view."
        },
        {
          "path": "frontend/src/lib/textSynthesis.ts",
          "operation": "create",
          "description": "Implement deterministic sentence synthesis utilities that produce exactly one sentence from the user’s stored onboarding answers using only the user’s wording, limited to punctuation/grammar/clarity edits (no additional ideas)."
        },
        {
          "path": "frontend/src/features/daily/DailySurface.tsx",
          "operation": "create",
          "description": "Create the daily experience view that renders an empty main content area when daily content is not due, and renders exactly one sentence (and no extra content) when daily content is due."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the daily experience into the normal mode rendering, ensuring that on silent days the main content area remains empty (no placeholder copy)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add the signature explanation view block titled exactly “Your Current Explanation” with a single sentence underneath and no commentary.",
      "acceptanceCriteria": [
        "When an explanation is available to show, the UI includes a centered block with the title text exactly “Your Current Explanation”.",
        "Only one sentence is displayed under the title.",
        "No additional labels, tooltips, disclaimers, encouragement, or interpretive commentary are shown alongside the explanation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/daily/ExplanationBlock.tsx",
          "operation": "create",
          "description": "Create a centered explanation block UI that renders the title text exactly “Your Current Explanation” and renders only one sentence underneath, with no additional adjacent copy."
        },
        {
          "path": "frontend/src/features/daily/DailySurface.tsx",
          "operation": "modify",
          "description": "Use ExplanationBlock as the sole renderer for the surfaced daily sentence so the centered layout and exact title are consistently applied."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add the interruption button “State it without cushioning.” to rewrite the displayed explanation into a more literal single sentence without adding new concepts or prohibited content.",
      "acceptanceCriteria": [
        "A button with the exact label “State it without cushioning.” is present when an explanation is being shown.",
        "Pressing the button replaces (or toggles) the displayed sentence with a single-sentence rewrite that is more literal and less euphemistic.",
        "The rewrite does not add advice, encouragement, reassurance, diagnosis, or suggested actions.",
        "The rewrite remains one sentence.",
        "The rewrite does not introduce the prohibited words list into app-generated text (see hard constraints requirement)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/textConstraints.ts",
          "operation": "create",
          "description": "Add a small validator for app-generated strings that enforces the prohibited-words list and disallows generating question marks post-onboarding; provide a safe fallback behavior (e.g., suppress render) when validation fails."
        },
        {
          "path": "frontend/src/lib/textSynthesis.ts",
          "operation": "modify",
          "description": "Add a deterministic 'without cushioning' rewrite function that transforms the currently displayed explanation into a more literal single sentence while staying within user-provided wording and passing textConstraints validation."
        },
        {
          "path": "frontend/src/features/daily/ExplanationBlock.tsx",
          "operation": "modify",
          "description": "Add the exact button labeled “State it without cushioning.” shown only when an explanation sentence is shown, and toggle/replace the displayed sentence with the rewrite output while keeping the content area constrained to the single sentence."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement the weekly consistency reflection: at most once per 7 days show “Where your logic bent.” with a short inconsistency-focused reflection and no suggestions.",
      "acceptanceCriteria": [
        "At most once in any rolling 7-day window per user, the app can surface the weekly reflection.",
        "When shown, the UI title is exactly “Where your logic bent.”",
        "The reflection text is short and focused on inconsistency in the user’s explanation framing (e.g., changes in explanation vs. stable priority) rather than describing the user’s actions or behavior.",
        "The reflection does not mention progress, success, failure, or suggest any changes or next steps.",
        "No questions are asked as part of the weekly reflection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSentenceHistory.ts",
          "operation": "create",
          "description": "Add a hook to load the user’s surfaced sentence history for the last period needed by the UI to generate a weekly inconsistency reflection."
        },
        {
          "path": "frontend/src/features/weekly/WeeklyReflection.tsx",
          "operation": "create",
          "description": "Create a weekly reflection view that renders the title exactly “Where your logic bent.” and a short reflection line derived from sentence history (inconsistencies in explanation framing), validated by textConstraints and containing no questions or suggestions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire weekly reflection priority into the normal experience: when weekly is due, render WeeklyReflection instead of daily content; ensure that when weekly is not due, it does not render."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Enforce hard constraints across all app-generated UI text: no advice/suggestions/diagnosis; no prohibited words; no questions after onboarding; preserve silence; avoid dashboard-like elements.",
      "acceptanceCriteria": [
        "After onboarding is complete, there are zero question marks or interrogative prompts presented by the app (excluding the onboarding questions themselves).",
        "No app-generated copy contains any of the prohibited words (case-insensitive match) listed by the user.",
        "The UI contains no streak counters, goals, scoring, reminders, notification prompts, or dashboard-style summaries.",
        "On days with no surfaced content, the UI does not fill the empty state with motivational or supportive messaging."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/textConstraints.ts",
          "operation": "modify",
          "description": "Centralize and export the prohibited-words list and post-onboarding question-mark prohibition checks; ensure all app-generated strings used in daily/weekly surfaces and controls are validated through this module."
        },
        {
          "path": "frontend/src/features/daily/DailySurface.tsx",
          "operation": "modify",
          "description": "Ensure the silent mode renders an empty main content region with no fallback messaging; ensure surfaced mode renders only the single sentence via validated text synthesis."
        },
        {
          "path": "frontend/src/features/weekly/WeeklyReflection.tsx",
          "operation": "modify",
          "description": "Ensure weekly reflection text is validated and contains no prohibited words, no progress/success/failure language, and no suggestions or questions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit and constrain any remaining app-generated UI strings (headers, buttons, errors) to avoid prohibited words and question marks after onboarding; ensure no dashboards/streak-like elements are introduced."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add a minimal reset control that clears onboarding answers and history without asking additional questions, and returns the user to onboarding step 1.",
      "acceptanceCriteria": [
        "A reset control exists (e.g., a small ‘Reset’ action) that clears the user’s stored loop and history.",
        "The reset interaction does not present any new questions (no confirmation dialogs phrased as questions).",
        "After reset, the next app view is the first onboarding question again."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/settings/ResetControl.tsx",
          "operation": "create",
          "description": "Create a minimal reset control (no confirmation phrased as a question) that triggers a backend reset capability (to be provided by backend work) and clears frontend cached state, then navigates the user back to onboarding step 1."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire ResetControl into the authenticated shell in a minimal non-dashboard way (e.g., small action in a header area), and after reset ensure the onboarding flow is shown again."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Apply a minimal, neutral, almost-clinical visual theme with restrained palette (avoid blue/purple), ample whitespace, and a centered explanation layout.",
      "acceptanceCriteria": [
        "UI uses a restrained neutral color palette (e.g., off-white/gray/black) and avoids decorative elements.",
        "Typography and spacing emphasize readability and calm neutrality.",
        "The explanation block is visually centered and prominent when shown.",
        "No celebratory, motivational, or emotionally supportive visual patterns appear (e.g., confetti, trophies, progress bars)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Create the stylesheet imported by main.tsx to establish minimal clinical typography and spacing defaults (while keeping palette restrained and avoiding blue/purple), and to define layout utilities for a centered content column."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Adjust global CSS variables and base styles to reinforce a neutral restrained palette and calm contrast, avoiding decorative accents; keep styling minimal and non-celebratory."
        },
        {
          "path": "frontend/src/features/daily/ExplanationBlock.tsx",
          "operation": "modify",
          "description": "Ensure the explanation block is visually centered with ample whitespace and clear typography, staying minimal and avoiding decorative UI patterns."
        }
      ]
    }
  ]
}