{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 4,
  "summary": "Personal minimal self-clarity app “Make It Make Sense” (The Coherence Engine) that captures a user’s exact onboarding answers, then mostly stays silent while occasionally surfacing single-sentence restatements of the user’s own logic; includes an explicit “Your Current Explanation” view, a one-sentence “State it without cushioning” rewrite, and a weekly inconsistency reflection—strictly no advice, encouragement, or follow-up questions after onboarding.",
  "existing_features": [
    {
      "id": "feature-implement-internet-identity-sign-in-and-a-per-user-app-state-so-each-signed-in-user-has-their-own-onboarding-answers-and-display-history",
      "title": "Implement Internet Identity sign-in and a per-user app state so each signed-in user has their own onboarding answers and display history.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-create-a-run-once-onboarding-flow-that-asks-exactly-these-four-questions-one-at-a-time-in-this-exact-wording-and-order-and-stores-the-user-s-responses-verbatim-no-summarizing-no-interpretation-1-what-do-you-say-matters-most-to-you-right-now-2-what-keeps-getting-more-of-your-time-or-energy-instead-3-how-do-you-usually-explain-that-difference-to-yourself-4-what-would-be-uncomfortable-to-admit-if-that-explanation-wasn-t-true",
      "title": "Create a run-once onboarding flow that asks exactly these four questions, one at a time, in this exact wording and order, and stores the user’s responses verbatim (no summarizing, no interpretation): 1) “What do you say matters most to you right now?” 2) “What keeps getting more of your time or energy instead?” 3) “How do you usually explain that difference to yourself?” 4) “What would be uncomfortable to admit if that explanation wasn’t true?”",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-mostly-silent-daily-experience-on-most-days-show-nothing-on-some-days-show-exactly-one-sentence-only-no-extra-text-where-that-sentence-is-a-restated-version-of-the-user-s-logic-loop-compressed-into-a-single-clear-line-using-only-the-user-s-stored-wording-edited-only-for-clarity-and-grammatical-coherence",
      "title": "Implement the mostly-silent daily experience: on most days show nothing; on some days show exactly one sentence only (no extra text), where that sentence is a restated version of the user’s logic loop compressed into a single clear line using only the user’s stored wording (edited only for clarity and grammatical coherence).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-add-the-signature-feature-view-that-when-content-is-shown-displays-a-centered-block-titled-exactly-your-current-explanation-with-one-sentence-underneath-built-entirely-from-the-user-s-words-edited-only-for-clarity-and-grammatical-coherence-with-no-truth-claims-and-no-commentary",
      "title": "Add the signature feature view that, when content is shown, displays a centered block titled exactly “Your Current Explanation” with one sentence underneath built entirely from the user’s words, edited only for clarity and grammatical coherence, with no truth claims and no commentary.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-interruption-button-labeled-exactly-state-it-without-cushioning-that-when-pressed-rewrites-the-currently-displayed-explanation-into-a-single-plain-literal-sentence-that-removes-euphemisms-and-justifications-while-still-avoiding-advice-comfort-validation-and-not-introducing-new-concepts-beyond-the-user-s-stored-wording",
      "title": "Implement the interruption button labeled exactly “State it without cushioning.” that, when pressed, rewrites the currently displayed explanation into a single plain, literal sentence that removes euphemisms and justifications, while still avoiding advice/comfort/validation and not introducing new concepts beyond the user’s stored wording.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-weekly-consistency-check-once-per-week-show-a-short-reflection-titled-exactly-where-your-logic-bent-that-describes-inconsistencies-in-explanations-not-behavior-never-mentions-progress-success-failure-and-never-suggests-change",
      "title": "Implement the weekly consistency check: once per week, show a short reflection titled exactly “Where your logic bent.” that describes inconsistencies in explanations (not behavior), never mentions progress/success/failure, and never suggests change.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-enforce-all-hard-constraints-across-all-app-generated-ui-text-and-generated-sentences-never-give-advice-suggest-action-encourage-effort-offer-reassurance-diagnose-or-ask-questions-after-onboarding-never-use-the-words-should-need-to-try-improve-better-fix-heal-grow-productive-in-any-app-generated-text-do-not-implement-streaks-goals-scores-reminders-or-dashboards-preserve-silence-is-a-feature",
      "title": "Enforce all hard constraints across all app-generated UI text and generated sentences: never give advice, suggest action, encourage effort, offer reassurance, diagnose, or ask questions after onboarding; never use the words “should”, “need to”, “try”, “improve”, “better”, “fix”, “heal”, “grow”, “productive” in any app-generated text; do not implement streaks, goals, scores, reminders, or dashboards; preserve “silence is a feature.”",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "feature-provide-a-minimal-settings-control-to-reset-the-onboarding-data-clear-stored-answers-and-history-without-asking-additional-questions-i-e-no-confirmation-phrased-as-a-question",
      "title": "Provide a minimal settings/control to reset the onboarding data (clear stored answers and history) without asking additional questions (i.e., no confirmation phrased as a question).",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "feature-apply-a-coherent-visual-theme-consistent-with-minimal-neutral-almost-clinical-language-as-the-interface-clarity-over-comfort-use-a-restrained-palette-avoid-blue-purple-simple-typography-ample-whitespace-and-a-centered-layout-for-the-explanation-block",
      "title": "Apply a coherent visual theme consistent with: minimal, neutral, almost clinical; language as the interface; clarity over comfort. Use a restrained palette (avoid blue/purple), simple typography, ample whitespace, and a centered layout for the explanation block.",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Onboarding flow (run once) asking exactly 4 specified questions one at a time; store user responses verbatim with no summarizing or interpretation",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Daily experience: usually show nothing; on some days show exactly one sentence restating the user’s own logic in a single clear line using only user-provided wording (edited only for clarity/grammar)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Signature feature screen: centered block titled “Your Current Explanation” displaying a single sentence built entirely from the user’s words (clarity/grammar edits only), with no truth claims or commentary",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Interruption button “State it without cushioning.” that rewrites the user’s explanation into one plain, literal sentence removing euphemisms/justifications, with no validation/comfort/advice",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Weekly consistency check: reflection titled “Where your logic bent.” describing inconsistencies in explanations (not behavior), with no mention of progress/success/failure and no suggestions to change",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Hard-constraints enforcement: never give advice/encouragement/diagnosis; never ask questions after onboarding; prohibit specific words (should, need to, try, improve, better, fix, heal, grow, productive); no streaks/goals/scores/reminders/dashboards; maintain minimal neutral clinical tone",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-14",
      "summary": "Persist the minimal data needed to support the product behavior: store onboarding answers verbatim, onboarding completion flag, timestamps for last time daily content was surfaced and last time weekly reflection was surfaced, and a small history of surfaced sentences (and/or their source template choices) sufficient to generate the weekly inconsistency reflection.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Store onboarding answers exactly as entered (verbatim) and only reuse/reshape user-provided wording for generated sentences; edits limited to clarity and grammatical coherence.",
    "Post-onboarding interaction model is non-interrogative: no questions are asked after onboarding; primary UI is silence with occasional single-sentence output.",
    "Enforce content/tone constraints globally, including banned words list and prohibition on advice/encouragement/diagnosis/suggestions."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "Make It Make Sense",
  "clarification_mode": "pro",
  "clarification_rounds": 0
}